hangcui1201/DSP_TI_TMS320F28379D/F28379D_Projects/libraries/boot_rom/f2838x/rev0/rom_sources/cpu1/F2838x_ROM/driverlib/hrpwm.h
//*****************************************************************************
//
//! Sets the period of the high resolution time base counter.
//!
//! \param base is the base address of the EPWM module.
//! \param periodCount is high resolution period count value.
//!
//! This function sets the period of the high resolution time base counter. The
//! value of periodCount is the value written to the register. User should
//! map the desired period or frequency of the waveform into the correct
//! periodCount.
//!
//! \b Note: periodCount is a 24 bit value
//!
//! \return None.
//
//*****************************************************************************
static inline void HRPWM_setTimeBasePeriod(uint32_t base, uint32_t periodCount)
{
    ASSERT(HRPWM_isBaseValid(base));
    ASSERT(periodCount < 0x1000000U);
    // write to TBPRD:TBPRDHR bit
    HWREG(base + HRPWM_O_TBPRDHR) = periodCount << 8U;
}

//*****************************************************************************
//
//! Gets the HRPWM period count.
//!
//! \param base is the base address of the EPWM module.
//!
//! This function gets the period of the HRPWM count.
//!
//! \return The period count value.
//
//*****************************************************************************
static inline uint32_t HRPWM_getTimeBasePeriod(uint32_t base)
{

    ASSERT(EPWM_isBaseValid(base));
    // read from TBPRD:TBPRDHR bit
    return(HWREG(base + HRPWM_O_TBPRDHR) >> 8U);
}

//*****************************************************************************
//
//! Sets the high resolution edge controlled by MEP (Micro Edge Positioner).
//!
//! \param base is the base address of the EPWM module.
//! \param channel is high resolution period module.
//! \param mepEdgeMode edge of the PWM that is controlled by MEP (Micro Edge
//!        Positioner).
//!
//! This function sets the edge of the PWM that is controlled by MEP (Micro
//! Edge Positioner). Valid values for the parameters are:
//!   channel
//!    - HRPWM_CHANNEL_A  - HRPWM A
//!    - HRPWM_CHANNEL_B  - HRPWM B
//!  mepEdgeMode
//!    - HRPWM_MEP_CTRL_DISABLE                 - HRPWM is disabled
//!    - HRPWM_MEP_CTRL_RISING_EDGE             - MEP (Micro Edge Positioner)
//!                                               controls rising edge.
//!    - HRPWM_MEP_CTRL_FALLING_EDGE            - MEP (Micro Edge Positioner)
//!                                               controls falling edge.
//!    - HRPWM_MEP_CTRL_RISING_AND_FALLING_EDGE - MEP (Micro Edge Positioner)
//!                                               controls both edges.
//!
//! \return None.
//
//*****************************************************************************
static inline void HRPWM_setMEPEdgeSelect(uint32_t base,
                                              HRPWM_Channel channel,
                                              HRPWM_MEPEdgeMode mepEdgeMode)
{
    ASSERT(HRPWM_isBaseValid(base));

    // Set the edge mode
    EALLOW;
    HWREGH(base + HRPWM_O_HRCNFG) =
             ((HWREGH(base + HRPWM_O_HRCNFG) & ~(0x3U << (uint16_t)channel )) |
              ((uint16_t)mepEdgeMode << (uint16_t)channel));
    EDIS;
}

//*****************************************************************************
//
//! Sets the MEP (Micro Edge Positioner) control mode.
//!
//! \param base is the base address of the EPWM module.
//! \param channel is high resolution period module.
//! \param mepCtrlMode is the MEP (Micro Edge Positioner) control mode.
//!
//! This function sets the mode (register type) the MEP (Micro Edge Positioner)
//! will control. Valid values for the parameters are:
//!   channel
//!    - HRPWM_CHANNEL_A  - HRPWM A
//!    - HRPWM_CHANNEL_B  - HRPWM B
//!   mepCtrlMode
//!    - HRPWM_MEP_DUTY_PERIOD_CTRL      - MEP (Micro Edge Positioner) is
//!                                        controled by value of CMPAHR/
//!                                        CMPBHR(depedning on the value of
//!                                        channel) or TBPRDHR.
//!    - HRPWM_MEP_PHASE_CTRL            - MEP (Micro Edge Positioner) is
//!                                        controlled by TBPHSHR.
//!
//! \return None.
//
//*****************************************************************************
static inline void HRPWM_setMEPControlMode(uint32_t base,
                                          HRPWM_Channel channel,
                                          HRPWM_MEPCtrlMode mepCtrlMode)
{
    ASSERT(HRPWM_isBaseValid(base));

    // Set the MEP control
    EALLOW;
    HWREGH(base + HRPWM_O_HRCNFG) =
       ((HWREGH(base + HRPWM_O_HRCNFG) & ~(0x1U << ((uint16_t)channel + 2U))) |
         ((uint16_t)mepCtrlMode << ((uint16_t)channel + 2U)));
    EDIS;
}

//*****************************************************************************
//
//! Sets the high resolution comparator load mode.
//!
//! \param base is the base address of the EPWM module.
//! \param channel is high resolution period module.
//! \param loadEvent is the MEP (Micro Edge Positioner) control mode.
//!
//! This function sets the shadow load mode of the high resolution comparator.
//! The function sets the COMPA or COMPB register depending on the channel
//! variable.
//! Valid values for the parameters are:
//!   channel
//!    - HRPWM_CHANNEL_A  - HRPWM A
//!    - HRPWM_CHANNEL_B  - HRPWM B
//!  loadEvent
//!    - HRPWM_LOAD_ON_CNTR_ZERO       - load when counter equals zero
//!    - HRPWM_LOAD_ON_CNTR_PERIOD     - load when counter equals period
//!    - HRPWM_LOAD_ON_CNTR_ZERO_PERIOD  - load when counter equals zero
//!                                               or period
//!
//! \return None.
//
//*****************************************************************************
static inline void HRPWM_setCounterCompareShadowLoadEvent(uint32_t base,
                                                 HRPWM_Channel channel,
                                                 HRPWM_LoadMode loadEvent)
{
    ASSERT(HRPWM_isBaseValid(base));

    // Set the CMPAHR or CMPBHR load mode
    EALLOW;
    HWREGH(base + HRPWM_O_HRCNFG) =
       ((HWREGH(base + HRPWM_O_HRCNFG) & ~(0x3U << ((uint16_t)channel + 3U))) |
         ((uint16_t)loadEvent << ((uint16_t)channel + 3U)));
    EDIS;
}

//*****************************************************************************
//
//! Sets the high resolution output swap mode.
//!
//! \param base is the base address of the EPWM module.
//! \param enableOutputSwap is the output swap flag.
//!
//! This function sets the HRPWM output swap mode. If enableOutputSwap is true,
//! ePWMxA signal appears on ePWMxB output and ePWMxB signal appears on ePWMxA
//! output. If it is false ePWMxA and ePWMxB outputs are unchanged
//!
//! \return None.
//
//*****************************************************************************
static inline void HRPWM_setOutputSwapMode(uint32_t base,
                                                bool enableOutputSwap)
{
    ASSERT(HRPWM_isBaseValid(base));

    EALLOW;

    if(enableOutputSwap)
    {
        HWREGH(base + HRPWM_O_HRCNFG) |= HRPWM_HRCNFG_SWAPAB;
    }
    else
    {
        HWREGH(base + HRPWM_O_HRCNFG) &= ~HRPWM_HRCNFG_SWAPAB;
    }
    EDIS;
}

//*****************************************************************************
//
//! Sets the high resolution output on ePWMxB
//!
//! \param base is the base address of the EPWM module.
//! \param outputOnB is the output signal on ePWMxB.
//!
//! This function sets the HRPWM output signal on ePWMxB. If outputOnB is
//! HRPWM_OUTPUT_ON_B_INV_A, ePWMxB output is an inverted version of
//! ePWMxA. If outputOnB is HRPWM_OUTPUT_ON_B_NORMAL, ePWMxB output is
//! ePWMxB.
//!
//! \return None.
//
//*****************************************************************************
static inline void HRPWM_setChannelBOutputPath(uint32_t base,
                                         HRPWM_ChannelBOutput outputOnB)
{
    ASSERT(HRPWM_isBaseValid(base));

