hangcui1201/DSP_TI_TMS320F28379D/F28379D_Projects/libraries/boot_rom/f2838x/rev0/rom_sources/cpu1/F2838x_ROM/driverlib/hrpwm.h
    // Set the output on ePWM B
    EALLOW;
    HWREGH(base + HRPWM_O_HRCNFG) =
            ((HWREGH(base + HRPWM_O_HRCNFG) & ~(HRPWM_HRCNFG_SELOUTB)) |
             ((uint16_t)outputOnB << 5U));
    EDIS;
}

//*****************************************************************************
//
//! Enables MEP (Micro Edge Positioner) automatic scale mode.
//!
//! \param base is the base address of the EPWM module.
//!
//! This function enables the MEP (Micro Edge Positioner) to automatically
//! scale HRMSTEP.
//!
//! \return None.
//
//*****************************************************************************
static inline void HRPWM_enableAutoConversion(uint32_t base)
{
    ASSERT(HRPWM_isBaseValid(base));

    // Enable MEP automatic scale
    EALLOW;

    HWREGH(base + HRPWM_O_HRCNFG) |= HRPWM_HRCNFG_AUTOCONV;

    EDIS;
}

//*****************************************************************************
//
//! Disables MEP automatic scale mode.
//!
//! \param base is the base address of the EPWM module.
//!
//! This function disables the MEP (Micro Edge Positioner) from automatically
//! scaling HRMSTEP.
//!
//! \return None.
//
//*****************************************************************************
static inline void HRPWM_disableAutoConversion(uint32_t base)
{
    ASSERT(HRPWM_isBaseValid(base));

    // Disable MEP automatic scale
    EALLOW;

    HWREGH(base + HRPWM_O_HRCNFG) &= ~HRPWM_HRCNFG_AUTOCONV;

    EDIS;
}

//*****************************************************************************
//
//! Enable high resolution period feature.
//!
//! \param base is the base address of the EPWM module.
//!
//! This function enables the high resolution period feature.
//!
//! \return None.
//
//*****************************************************************************
static inline void HRPWM_enablePeriodControl(uint32_t base)
{
    ASSERT(HRPWM_isBaseValid(base));

    // Set HRPE bit
    EALLOW;

    HWREGH(base + HRPWM_O_HRPCTL) |= HRPWM_HRPCTL_HRPE;

    EDIS;
}

//*****************************************************************************
//
//! Disable high resolution period feature.
//!
//! \param base is the base address of the EPWM module.
//!
//! This function disables the high resolution period feature.
//!
//! \return None.
//
//*****************************************************************************
static inline void HRPWM_disablePeriodControl(uint32_t base)
{
    ASSERT(HRPWM_isBaseValid(base));

    // Clear HRPE bit
    EALLOW;

    HWREGH(base + HRPWM_O_HRPCTL) &= ~HRPWM_HRPCTL_HRPE;

    EDIS;
}

//*****************************************************************************
//
//! Enable high resolution phase load
//!
//! \param base is the base address of the EPWM module.
//!
//! This function enables loading of high resolution phase shift value which is
//! set by the function HRPWM_setPhaseShift().
//!
//! \return None.
//
//*****************************************************************************
static inline void HRPWM_enablePhaseShiftLoad(uint32_t base)
{
    ASSERT(HRPWM_isBaseValid(base));

    // Set TBPHSHRLOADE bit
    EALLOW;

    HWREGH(base + HRPWM_O_HRPCTL) |= HRPWM_HRPCTL_TBPHSHRLOADE;

    EDIS;
}

//*****************************************************************************
//
//! Disable high resolution phase load
//!
//! \param base is the base address of the EPWM module.
//!
//! This function disables loading of high resolution phase shift value.
//!
//! \return
//
//*****************************************************************************
static inline void HRPWM_disablePhaseShiftLoad(uint32_t base)
{
    ASSERT(HRPWM_isBaseValid(base));

    // Clear TBPHSHRLOADE bit
    EALLOW;

    HWREGH(base + HRPWM_O_HRPCTL) &= ~HRPWM_HRPCTL_TBPHSHRLOADE;

    EDIS;
}

//*****************************************************************************
//
//! Set high resolution PWMSYNC source.
//!
//! \param base is the base address of the EPWM module.
//! \param syncPulseSource is the PWMSYNC source.
//!
//! This function sets the high resolution PWMSYNC pulse source.
//! Valid values for syncPulseSource are:
//!   - HRPWM_PWMSYNC_SOURCE_PERIOD      - Counter equals Period.
//!   - HRPWM_PWMSYNC_SOURCE_ZERO        - Counter equals zero.
//!   - HRPWM_PWMSYNC_SOURCE_COMPC_UP    - Counter equals COMPC when
//!                                         counting up.
//!   - HRPWM_PWMSYNC_SOURCE_COMPC_DOWN  - Counter equals COMPC when
//!                                         counting down.
//!   - HRPWM_PWMSYNC_SOURCE_COMPD_UP    - Counter equals COMPD when
//!                                         counting up.
//!   - HRPWM_PWMSYNC_SOURCE_COMPD_DOWN  - Counter equals COMPD when
//!                                         counting down.
//!
//! \return None.
//
//*****************************************************************************
static inline void HRPWM_setSyncPulseSource(uint32_t base,
                                   HRPWM_SyncPulseSource syncPulseSource)
{
    ASSERT(HRPWM_isBaseValid(base));

    // Set the PWMSYNC source
    EALLOW;
    // If HRPWM_PWMSYNC_SOURCE_PERIOD or HRPWM_PWMSYNC_SOURCE_ZERO
    if(syncPulseSource < HRPWM_PWMSYNC_SOURCE_COMPC_UP)
    {
        HWREGH(base + HRPWM_O_HRPCTL) =
          ((HWREGH(base + HRPWM_O_HRPCTL) &
          ~(HRPWM_HRPCTL_PWMSYNCSELX_M | HRPWM_HRPCTL_PWMSYNCSEL)) |
           ((uint16_t)syncPulseSource << 1U));
    }
    else
    {
        HWREGH(base + HRPWM_O_HRPCTL) =
          ((HWREGH(base + HRPWM_O_HRPCTL) & ~HRPWM_HRPCTL_PWMSYNCSELX_M) |
           ((uint16_t)syncPulseSource << HRPWM_HRPCTL_PWMSYNCSELX_S));
    }
    EDIS;
}

//*****************************************************************************
//
//! Set high resolution counter compare values.
//!
//! \param base is the base address of the EPWM module.
//! \param compModule is the Compare value module.
//! \param compCount is the counter compare count value.
//!
//! This function sets the high resolution counter compare value for counter
//! compare registers.
//! Valid values for compModule are:
//!  - HRPWM_COUNTER_COMPARE_A - counter compare A.
//!  - HRPWM_COUNTER_COMPARE_B - counter compare B.
//!
//! \b Note: compCount is a 24 bit value
//!
//! \return None.
//
//*****************************************************************************
static inline void HRPWM_setCounterCompareValue(uint32_t base,
                                         HRPWM_CounterCompareModule compModule,
                                         uint32_t compCount)
{
    ASSERT(HRPWM_isBaseValid(base));

    ASSERT(compCount < 0x1000000U);
    // Write to the high resolution counter compare registers.
    if(compModule == HRPWM_COUNTER_COMPARE_A)
    {
        // write to CMPAHR
        HWREG(base + HRPWM_O_CMPA) = compCount << 8U;
    }
    else
    {
        // write to CMPBHR
        HWREG(base + HRPWM_O_CMPB) = compCount << 8U;
    }
}

//*****************************************************************************
//
//! Gets high resolution counter compare values.
//!
//! \param base is the base address of the EPWM module.
//! \param compModule is the Compare value module.
//!
//! This function gets the high resolution counter compare value for counter
//! compare registers specified.
//! Valid values for compModule are:
//!  - HRPWM_COUNTER_COMPARE_A - counter compare A.
//!  - HRPWM_COUNTER_COMPARE_B - counter compare B.
//!
//!
//! \return None.
//
//*****************************************************************************
static inline uint32_t HRPWM_getCounterCompareValue(uint32_t base,
                                         HRPWM_CounterCompareModule compModule)
{
    uint32_t compCount;

    ASSERT(HRPWM_isBaseValid(base));

    // Write to the high resolution counter compare registers.
    if(compModule == HRPWM_COUNTER_COMPARE_A)
    {
        // read from CMPAHR
        compCount = HWREG(base + HRPWM_O_CMPA) >> 8U;
    }
    else
    {
        // read from CMPBHR
        compCount = HWREG(base + HRPWM_O_CMPB) >> 8U;
    }

    return(compCount);
}

//*****************************************************************************
//
//! Set High Resolution RED count
//!
//! \param base is the base address of the EPWM module.
//! \param redCount is the high resolution RED count.
//!
//! This function sets the high resolution RED (Rising Edge Delay) count value.
//! The value of redCount should be less than 0x200000.
//!
//! \b Note: redCount is a 21 bit value
//!
//! \return None.
//
//*****************************************************************************
static inline void HRPWM_setRisingEdgeDelay(uint32_t base, uint32_t redCount)
{
    ASSERT(HRPWM_isBaseValid(base));
    ASSERT(redCount < 0x200000);

    // Set the High Resolution RED (Rising Edge Delay) count
    HWREG(base + HRPWM_O_DBREDHR) = redCount << 9U;
}

//*****************************************************************************
//
//! Set High Resolution FED count
//!
//! \param base is the base address of the EPWM module.
//! \param fedCount is the high resolution FED count.
//!
//! This function sets the high resolution FED (Falling Edge Delay) count
//! value. The value of fedCount should be less than 0x200000.
//!
//! \b Note: fedCount is a 21 bit value
//!
//! \return None.
//
//*****************************************************************************
static inline void HRPWM_setFallingEdgeDelay(uint32_t base, uint32_t fedCount)
{
    ASSERT(HRPWM_isBaseValid(base));
    ASSERT(fedCount < 0x200000);

